Tekla Open API Reference for Tekla Structures 2025
Events.TeklaStructuresExit Event
 The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called the user will no longer be able to perform any calls to Tekla Structures.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.TeklaStructuresExitDelegate TeklaStructuresExit
Public Event TeklaStructuresExit As Events.TeklaStructuresExitDelegate
Value
Type: Tekla.Structures.Model.Events.TeklaStructuresExitDelegate
Implements
IEvents.TeklaStructuresExit
See Also
Reference
Events Class
Tekla.Structures.Model Namespace